<?php

// 2Moons - Copyright © 2012 Jan Kröpke <info@2moons.cc>
// Translation into Ukrainian - Copyright © 2015 Mykhailo Chika <http://mykhailochika.16mb.com>

$LNG['faq_overview'] = 'Туторіал';

$LNG['questions'] = array ();
$LNG['questions'] [1] ['category'] = 'Поради для початківців';
$LNG['questions'] [1] [1] ['title'] = 'Крок 1';
$LNG['questions'][1][1]['body']  = <<<BODY
<p>У цій частині туторіал описані основні споруди. Ви дізнаєтеся, які споруди слід будувати на самому початку гри, і для чого вони потрібні. Для успішного створення імперії важливо проводити будівництво в певній черговості.</p>
<h3>Сонячна електростанція</h3>
<p>Для видобутку ресурсів, необхідних для створення імперії, слід побудувати цю споруду в найпершу чергу. Вона забезпечує рудники для видобутку металу, кристала і синтезатори дейтерію електроенергією. Як тільки електростанція буде побудована, в меню "Сировина" можна побачити, скільки енергії виробляється в даний момент.</p>
<h3>Рудник з видобутку металу:</h3>
<p>Метал - один з трьох ресурсів, які можна добувати в грі. Він використовується майже у всіх будівлях і дослідженнях, тому ми радимо добре розвинути цей рудник. Особливо на самому початку дуже важливо мати рудник по видобутку металу на кілька рівнів вище, ніж у інших початківців гравців.</p>
<h3> Рудник з видобутку кристала і синтезатор дейтерію:</h3>
<p>Кристал необхідний для будування кораблів, спорудження будівель і проведення досліджень. Він видобувається в меншій кількості, ніж метал, що, однак, не робить його менш важливим ресурсом. Протягом гри Ви зможете переконатися, наскільки гарячі бої відбуваються через кристала. Дейтерій використовується для виробництва енергії (в термоядерної електростанції), в якості палива для кораблів і основного ресурсу для деяких важливих досліджень і споруд (дослідна лабораторія).</p>
BODY;

$LNG['questions'] [1] [2] ['title'] = 'Крок 2';
$LNG['questions'] [1] [2] ['body'] = <<< BODY
<p>Для розширення своєї імперії і суперництва з іншими гравцями Вам необхідні ще споруди. За допомогою досліджень та будівництва корабельної верфі Ви можете почати будівництво флоту і планетарної оборони. Більш докладно дивіться тут:</ p>
<h3>Верф:</ h3>
<p>Тут будуються всі типи кораблів, наявних в грі. Незважаючи на те, що верф можна будувати на самому початку гри, для будівництва певних типів кораблів Вам буде необхідно провести відповідні дослідження. Огляд досліджень, необхідних для будівництва певного корабля або оборони, можна знайти в меню "Технології". Чим вище рівень верфі, тим більше скорочується час будівництва.</p>
<h3>Дослідницька лабораторія:</h3>
<p>Тут проводяться дослідження, необхідні для будівництва нових типів споруд, оборони та початку нових досліджень. Крім того, дослідження можуть покращувати вже існуючі досягнення. Чим вище рівень дослідної лабораторії, тим коротше час досліджень.</p>
<h3>Фабрика роботів:</h3>
<p>Фабрика роботів скорочує час будівництва будівель. З кожним рівнем будівлі будуються все довше, для скорочення цього часу необхідно подальший розвиток фабрики роботів.</p>
BODY;

$LNG['questions'] [1] [3] ['title'] = 'Крок 3';
$LNG['questions'] [1] [3] ['body'] = <<< BODY
<p> Ця частина туторіал присвячена обороні планети, а також перші дії з флотом. </ p>
<h3> Огляд галактики: </ h3>
<p> Необхідний для локалізації інших гравців. У цьому огляді можна знайти докладну інформацію про інших планетах, а також частково відправляти прямо звідти свій флот. Також з цього огляду можна писати особисті повідомлення і відправляти шпигунські зонди, якщо вони вже є на планеті. </ P>
<h3> Відправлення флоту: </ h3>
<p> Флоти можна відправляти або через огляд галактики, або з меню "Флот". Для початку виберіть, скільки і які типи кораблів Ви хочете відправити. Після цього Ви вказуєте координати цілі (можна дізнатися в огляді галактики) і швидкість польоту. Флотам можна віддавати такі накази: "Атакувати", "Розташувати", "Утримувати", "Переробити". </ P>
<h3> Оборона: </ h3>
<p> Для оборони своєї планети крім верфі можна будувати оборонні знаряддя. Вони надають деякий захист нарівні зі флотом під час ворожих нападів. На відміну від флоту, 70% оборонних знарядь можуть відновлюватися самі по собі після бою. </ P>
BODY;

$LNG['questions'] [2] ['category'] = 'Розширена інформація';
$LNG['questions'] [2] [1] ['title'] = 'Грабіж';
$LNG['questions'] [2] [1] ['body'] = <<< BODY
<h3>Грабіж:</ h3>
<p> Під грабунком розуміється атака іншого гравця з метою захоплення його ресурсів.
Існує кілька видів грабежу:</p>
<ul>
<li>Грабіж ферми</li>
<li>Атака флоту</li>
<li>Грабіж уламків </ li>
<li>підлий</li>
</ul>
<h3>Грабіж ферм:</h3>
<p>Самий найбільш часто зустрічається вид грабежу.<br>
Гравець сканує прилеглі планети і відправляє на них флоти, які можуть понести достатньо ресурсів, і які мають достатньо бойової потужності для пролому оборони та успішного повернення на базу.</p>
<h3>Атака флоту:</h3>
<p>Вищий клас грабежу.<br>
При цьому виді цілеспрямовано атакуются ворожі флоти.<br>
Крім шпигунських зондів і удачі для атаки флоту потрібно сенсорна фаланга і досвід. Як тільки ворожий флот знайдений, його треба атакувати і переробити уламки. Найчастіше це непросто, тому флоти, що несуть в собі великий прибуток у вигляді уламків, як правило не можуть бути перероблені власними переробниками, тому на допомогу треба закликати інших гравців, або організовувати атаку через САБ. </ p>
<h3>Грабіж уламків:</h3>
<p>Найзручніший і самий зневажаються вид наживи, при якому гравець збирає чужі уламки.
Згідно з правилами уламки не належать нікому, і їх може збирати хто завгодно, тому така крадіжка найчастіше є великою неприємністю.</p>
<h3>підлий</h3>
<p>Cмисл життя флотовода полягає в тому, щоб побудувати свій флот і знищувати ворожі флоти. Так як ворожі флоти не стоять в очікуванні атаки, то для їх підловити треба докласти трохи зусиль. Підловити флот під час сейви або під час атаки, проте це не так просто, тому існують способи захисту від підловити. </p>
<ul>
<li> <p>Місяць полегшує підлий, тому за допомогою сенсорної фаланги можна вистежити ворожий флот. Коли флот вистежений, треба вирахувати, коли він буде підлітати назад до бази. Для цього треба знати, до якого рівня розвинені двигуни у кораблів, що можна дізнатися з розвідданих. Знаючи дані двигунів можна вирахувати, скільки флот ще буде в дорозі. Якщо поставити будильник на час прильоту, то у Вас буде хороший шанс! </ P>
<p> Для розрахунку часу існують спеціальні програми, посилання на які можна знайти на форумі. <br> Знаючи час прильоту, Ви відправляєте свій флот і переробників так, щоб вони прибули на планету на 3 секунди пізніше і знищили флот. </ p> </ li>
<li> <p> Якщо Ви хочете підловити флот, що летить з місяця до поля уламків, то Вам буде потрібно приблизний час його вильоту. Потім Ви робите кілька видимих полів уламків (напр., Шпигунськими зондами) там, куди, на Вашу думку, летить цей флот. Тепер Ви розраховуєте, скільки часу знадобиться цього флоту для досягнення цих полів, а коли флот наблизиться до уламків, то при постійній актуалізації Ви можете побачити, коли уламки зникнуть. Тепер Ви вираховуєте, скільки часу флот буде летіти назад, і відправляєте свій флот так, щоб вони прибув на кілька секунд пізніше. </ P>
<p> <b> Увага: </ b> такий підлий виходить не завжди, тому існують деякі способи захисту. Наприклад, можна вислати один переробник, який заздалегідь збере уламки. </ P> </ li>
<li> Ще одна форма підловити - це утримання на чужій орбіті свого флоту з метою захисту від атакуючих флотів. Атакуючий флот у такому разі відгукується, тому йому довелося б боротися проти двох флотів. Проти такого підловити можна захиститися, зробивши сейвскан (див. Сейвскан). </ Li>
<li> <p> Якщо флот летить на утримання на іншу планету і раптово повертається назад, то тоді він не видно в фаланзі. Але є один спосіб, як такий флот можна підловити. Для цього треба деякий час спостерігати як гравець сейвів свій флот, коли вилітає і коли скасовує політ. При посекундному скануванні планети помітно, коли флот більше не видно, знаючи час повернення з симулятора, Ви відправляєте свій так, що б він прибув на планету із затримкою в кілька секунд. </ P>
<p> Якщо гравець летить з місяця до поля уламків і висилає вперед переробників, то підловити його практично неможливо. Однак є один спосіб - знищити луну за допомогою ЗС. </ P>
<p> Коли місяць знищена, то фалангою сканується планета, на яку тепер автоматично повертається флот, далі все робиться як описано вище. </ p>
<p> При підловити завжди дуже корисно знати, як противник сейвів свій флот - наприклад кожен день о 23 годині, або в 12 годин він з'являється он-лайн. Тому перед підловити добре вивчіть супротивника! </ P> </ li>
</ ul>
BODY;

$LNG['questions'] [2] [2] ['title'] = 'Сейв флоту';
$LNG['questions'] [2] [2] ['body'] = <<< BODY
<h3>Як мені захиститися?</ h3>
<p> Велика кількість оборони відлякує одних гравців, але, на жаль, залучає інших, і вони приходять і приходять, поки на планеті більше нічого не залишається. При цьому втрачається багато ресурсів, тому з оборони не виходять поля уламків (за винятком окремих всесвітів, де це можливо). Але навіть в готельних всесвітів, де це можливо, не варто будувати занадто багато оборони, тому це уламки будуть просто подарунком атакуючому. </p>
<p> Ще існують міжпланетні ракети, чия єдина задача - знищення оборони. На відміну від атаки флотом, оборона після ракетної атаки не відновлюється. Добре спланований напад із застосуванням ракет знижує ризик для власного флоту. </p>
<p> Великі флоти теж утримують тільки більш слабких гравців, зате більш сильні із задоволенням нападуть на такий флот, щоб зібрати потім його уламки. Зрештою ще є САБ, яка дає можливість кільком слабким гравцям атакувати більш сильного. </p>
<p> Добре розвинена шпигунська технологія - найдорожчий спосіб приховати від противника інформацію про себе, за винятком інформації про ресурси. На жаль високий рівень шпигунства може бути подоланий великою кількістю ворожих зондів, і якщо в перших розвідданих противник бачить достатньо ресурсів, то він шле набагато більше зондів, щоб дізнатися все про планету. </p>
<p> Найкраща можливість захисту - не дати противнику побачити скільки ресурсів є на планеті. Це робиться так - всі ресурси відправляються з усім флотом, принаймні на той час, поки гравця немає в грі. Так як атака в польоті неможлива, то кораблі і ресурси знаходяться в безпеці. </p>
<h3> Сейв як краща оборона </h3>
<p> Сейв флоту є однією з найважливіших деталей ОГейма, якої, на жаль, мають не всі гравці. Існує безліч способів захищати свої ресурси і флот від ворожих атак, деякі з них надійні на 100%, деякі ні. <br>
Перший метод сейви - "утримання і повернення". Для цього гравець відправляє свій флот на одну зі своїх колоній із завданням "утримувати". Потім цей політ переривається і зворотний політ не бачимо сенсорної фалангою. Цей спосіб не повністю надійний, але якщо скасувати політ не в останній момент, а на кілька годин раніше, то зловити флот буде неймовірно складно. </p>
<p> Інший дуже широко використовуваний спосіб - політ з місяця до поля уламків. Цей спосіб вважається відносно надійним, тому такі польоти не є видимим фалангою. Однак якщо противник знає, коли флот досяг уламків, то він може розрахувати, коли флот повернеться назад на планету. Але можна перед основним флотом запустити так званих "тіньових переробників", які зберуть уламки до прибуття туди основного флоту, і тим самим введуть противника в оману. Ще один спосіб зробити такий політ надійним - збір уламків біля абсолютно незахищеною планети, тому воно ніколи не відображається в "галактиці". </p>
<p> Найнадійніший вид сейви - це утримання на різних місяцях. Такий політ не видний ні в якій фаланзі, і спостереження за полями уламків тут теж безглуздо. Єдина можливість підловити такий флот - це знищити місяць, що можна зробити тільки при величезних витратах часу і ресурсів. </p>
BODY;

$LNG['questions'] [2] [2] ['title'] = 'Система альянсовую бою';
$LNG['questions'] [2] [2] ['body'] = <<< BODY
<h3>Атака з САБ</ h3>
<p>Щоб атакувати з САБ для початку треба відправити флот з наказом "атакувати". Після початку атаки в меню флотів Ви натискаєте на "союз" і перетворюєте свій флот в союз з декількох флотів. У меню, спілки Ви можете дати союзу інша назва або запрошувати в союз нових гравців. Гравець, який почав атаку, автоматично потрапляє в союз. Приєднайте всі бажані флоти і союз готовий. Для цього кожен запрошений гравець при вказівці мети атаки повинен віддати наказ "спільна атака". Швидкість всього союзу відповідає швидкості самого повільного флоту. Швидкі флоти не впливають нв швидкість всього союзу, повільні ж сповільнюють його до своєї швидкості. Зверніть увагу, що в союзі можуть брати участь максимум 5 гравців із загальною кількістю флотів, що не перевищує 16. приєднатися до союзу флот може збільшити час польоту на максимум 30%. Наприклад, якщо союзу залишилося летіти 100 хвилин, то після приєднання ще одного флоту максимальний час складає 130 хв. <br>
<b> Увага: </b> якщо флот засновника союзу відгукується, то інші флоти продовжують летіти далі! </p>
<h3> Оборона з САБ </h3>
<p> При ворожої атаці у Вас є можливість отримати допомогу від дружніх гравців у вигляді флотів. Це стосується всіх гравців, які перебували у Вашому альянсі, або в списку друзів. Їм просто треба відправити свої флоти на Ваші координати з наказом «Триматися» і вказати, як довго їм слід залишатися на Вашій орбіті. Крім витрат дейтерію на політ, дружні гравці також платять певну суму ресурсів, що залежить від розміру флоту і тривалості перебування на орбіті. Ця сума зчитується при старті флоту. Знаходяться на орбіті флоти беруть участь у всіх боях на планеті і на місяцях. У розвідданих вони відображаються як Ваші власні флоти, тому необхідно відправляти їх так, щоб вони прилітали на орбіту незадовго до атаки, і т.ч. не могли бути помічені. Власники флотів завжди можуть відкликати їх в меню «флот», якщо їх не відкликати, то вони протримаються на орбіті вказане при старті час. </p>
<h3>Споживання дейтерію за 1 годину утримання на орбіті:</h3>
<p>Малий транспорт: 5 <br>
Великий транспорт: 5 <br>
Легкий винищувач: 2 <br>
Важкий винищувач: 7 <br>
Крейсер: 30 <br>
Лінкор: 50 <br>
Колонізатор: 100 <br>
Переробник: 30 <br>
Шпигунський зонд: 0,1 <br>
Бомбардувальник: 100 <br>
Знищувач: 100 <br>
Зірка смерті: 0,1 </ p>
BODY;

$LNG['questions'] [2] [3] ['title'] = 'Місяця';
$LNG['questions'] [2] [3] ['body'] = <<< BODY
<p> Місяць може з'явитися при наявності поля уламків з мінімум 100 000 одиниць, в цьому випадку шанс на появу місяця становить 1%. Максимальний шанс становить 20% незалежно від розміру поля уламків. </ P>
<h3> Загальна </ h3>
<p> Місяця можна перейменовувати як планети, але врешті завжди буде стояти «Луна». Біля однієї планети можна мати тільки одну місяць. За допомогою місяця можна непомітно відправляти флоти в сейв, тому коштувати зробити її якомога раніше. На місяці можна будувати фабрику роботів, верф, сховище для металу, кристала і дейтерію, склад альянсу, місячну базу, сенсорну фалангу і ворота. </ P>
<h3> Створення місяця </ h3>
<p> Під створенням місяця мається на увазі умисне знищення флоту для створення поля уламків. Як правило для цього використовуються легкі винищувачі, т.к. їх легше всього знищити. Для 20% -го шансу появи місяця треба знищити 1667 штук. Зверніть увагу, що якщо місяць робиться сильним і слабким гравцем, то уламки збирає тільки слабкий, інакше це буде прокачка. </ P>
<p> У всесвіті, в якій розбита оборона також потрапляє в уламки, це виходить краще, тому один раз побудовану оборону можна розбивати кілька разів. Для цього радиться будувати 3334 ракетних установок або 3334 легких лазера. </ P>
<p> При появі місяця з'являється повідомлення «неймовірні маси вільного металу і кристала утворюють супутник біля планети». </ p>
<p> При шансі появи місяця між 1 і 19% існує 20% -ва ймовірність того, що діаметр місяця буде більш 8000км. <br> Місяць ніколи не може бути більше 8944 км в діаметрі. </ p>
<h3> Забудова </ h3>
<p> Як було зазначено вище, на місяці можна будувати фабрику роботів, верф, сховище для металу, кристала і дейтерію, склад альянсу, місячну базу, сенсорну фалангу і ворота. Однак не варто будувати якісь сховища, тому на місяцях нічого не видобувається, і їх будівництво буде безглуздо. Верф також не варто будувати, тому кораблі і оборона на місяцях будуються дуже довго. Доцільність будівництва складу альянсу все ще спірна. <br>
Три важливих будівлі на місяці: </ p>
<ul>
<li> <p> <b> Місячна база </ b> <br> Служить для створення нових полів для будівництва, за кожен рівень дається 3 додаткових поля, одне з яких потім буде зайнято наступним рівнем бази. </ p> </ li>
<li> <p> <b> Сенсорна фаланга </ b> <br> Служить для стеження за пересуваннями ворожих флотів на планетах. Шпигунство за місяцями неможливий. Кожен рівень збільшує радіус дії. </ P> </ li>
<li> <p> <b> Телепорт </ b> <br> За допомогою воріт можна без втрати часу переміщати флоти між місяцями, проте транспортування ресурсів при цьому неможлива. Між стрибками повинен пройти 1 годину, інакше ворота перегріються. </ P> </ li> </ ul>
<p> Нижче наведено список оптимальної забудови місяця: <br>
<b> Легенда: </ b> <br>
ЛБ - місячна база <br>
СФ - сенсорна фаланга <br>
ВТ - ворота <br>
ФР - фабрика роботів </ p>
<p> ЛБ1 - ФР1 - ФР2 - ЛБ2 - СФ1 - ФР3 - ЛБ3 - СФ2 - ФР4 - ЛБ4 - СФ3 - ФР5 - ЛБ5 - СФ4 - ФР6 - ЛБ6 - СФ5 - СФ6 - ЛБ7 - СФ7 - СФ8 - ЛБ8 - ВТ1 <br >
Після цього можна продовжувати будувати СФ якщо для цього вистачає ресурсів. Також можна знести кілька рівнів фабрики роботів і звільнити тим самим місце для СФ! </ P>
<h3> Знищення </ h3>
<p> Місяць можна знищити, але тільки за допомогою зірки смерті. </ p>
<p> Для цього вибирається наказ «знищити». Для початку ЗС повинна знищити стоїть на місяці флот. При знищенні місяця ЗС теж може бути знищена. Поле уламків при знищенні місяця не виникає! </ P>
<h3> Атака лун зірками смерті: </ h3>
<p> Шанс знищення місяця становить "(100 - корінь (розмір місяця)) * корінь (кол-во ЗС)". Шанс того, що ЗС теж знищаться становить "корінь (розмір місяця) / 2". Чим більше місяць, тим більше шанс втратити ЗС. </ P>
<h3> Шанс на появу місяця і її розмір: </ h3>
<p> 100 000 одиниць уламків відповідають 1% -му шансу на появу місяця. Максимальний шанс - 20%. Після зміни максимальний розмір місяця становить 79 полів для будівництва. <br>
Раніше розмір розраховувався так: <br>
округлі. ((діаметр місяця / 1000) 2) <br>
Найбільша місяць може бути 8944 км в діаметрі, тобто 79 полів. </ P>
BODY;

$LNG['questions'] [2] [4] ['title'] = 'Альянси';
$LNG['questions'] [2] [4] ['body'] = <<< BODY
<h3> Як заснувати свій альянс? </ h3>
<p> Для того, щоб заснувати альянс, зайдіть в меню "Мій альянс". Потім на "Заснувати свій альянс". Потім треба ввести тег і назва альянсу, тег - це скорочення від повної назви. Наприклад, якщо назву "My Top Ally", то тег можна зробити "MTA". <br>
Назва і тег можуть містити тільки букви, цифри та пробіли. <br>
Натисніть на "заснувати". <br>
Якщо альянс з такою назвою або тегом вже існує, то Ви отримаєте відповідне повідомлення, і Вам доведеться змінити назву / тег. <br>
Якщо альянс створений, то Ви побачите повідомлення. Натисніть "далі" і Ви потрапите в порожнє меню альянсу, в яке тепер можна потрапити з меню "мій альянс". У ньому видно кілька варіантів вибору та інформація про альянс, вгорі видно назву і тег альянсу. </ P>
<p> Внизу знаходяться наступні посилання: <br>
"Члени": тут видно всі члени Вашої альянсу, їх рейтинг, координати головних планет, дата вступу і онлайн статус. Клік на назві стовпця може змінити сортування. <br>
"Ваш ранг": тут видно назву вашого рангу, поруч - посилання на управління альянсу. <br>
"Загальне повідомлення": відправка повідомлення всім членам альянсу або окремим рангах. </ P>
<h3> Управління альянсом </ h3>
<p> Вгорі знаходиться меню "Встановити ранги", де можна встановити права для різних рангів. Нижче знаходиться меню "Члени альянсу", тут можна видаляти з альянсу, призначати ранги та переглядати скільки часу той чи інший гравець не був у грі. За допомогою двох кнопок трохи нижче можна міняти назву і тег альянсу. <br>
Нижче можна редагувати зовнішній і внутрішній текст альянсу. Зовнішній текст бачать всі гравці, внутрішній - тільки члени альянсу. "Текст заявки" - це приклад заявки для бажаючих вступити до альянсу. <br>
У налаштуваннях можна вставити посилання на картинку, яку буде видно на сторінці альянсу в грі, а також посилання до форуму альянсу, якщо такий є. Крім того, можна включати і відключати прийом заявок, і редагувати назву рангу для засновника альянсу. Якщо ранг залишити порожнім, то автоматично він називатиметься "Засновник". <br>
Розпустити альянс можна відповідною кнопкою, а "Покинути / перейняти альянс" передає управління альянсом іншому гравцеві. </ P>
BODY;
