<?php

// 2Moons - Copyright © 2012 Jan Kröpke <info@2moons.cc>
// Translation into Ukrainian - Copyright © 2015 Mykhailo Chika <http://mykhailochika.16mb.com>

$LNG['back'] = 'Назад';
$LNG['continue'] = 'Далі';
$LNG['continueUpgrade'] = 'Оновити';
$LNG['login'] = 'Увійти в панель адміністратора';

$LNG['menu_intro'] = 'Опис';
$LNG['menu_install'] = 'Установка';
$LNG['menu_license'] = 'Ліцензія';
$LNG['menu_upgrade'] = 'Оновлення';

$LNG['title_install'] = 'Установник';

$LNG['intro_lang'] = 'Мова';
$LNG['intro_install'] = 'Встановити';
$LNG['intro_welcome'] = 'Ласкаво просимо в 2Moons!';
$LNG['intro_text'] = '2Moons - один з кращих клонів OGame. <br> 2Moons є найстабільнішим і розвиваються движком з усіх подібних XNova на даний момент. Ми сподіваємося, що 2Moons буде краще, ніж Ви очікуєте. <br> <br> Якщо у Вас будуть питання, консультуйтеся з нами. <br> <br> 2Moons є проектом з відкритим кодом і розповсюджується під ліцензією GNU GPL v3, ознайомитися з якої Ви можете у розділі Ліцензія. <br> <br> Перед установкою буде запущений невеликий тест на відповідність мінімальним вимогам. ';
$LNG['intro_upgrade_head'] = '2Moons вже встановлена';
$LNG['intro_upgrade_text'] = '<p> Ви вже встановили 2Moons і просто хочете її поновити? </p> <p> Тут ви можете оновити стару базу даних за допомогою декількох кліків. </p>';

$LNG['upgrade_success'] = 'База даних успішно оновлено до ревізії %s.';
$LNG['upgrade_nothingtodo'] = 'Ніяких дій не потрібно, база даних має стан ревізії %s.';
$LNG['upgrade_back'] = 'Назад';
$LNG['upgrade_intro_welcome'] = 'Майстер оновлення бази даних';
$LNG['upgrade_available'] = 'Оновлення доступно. База даних може бути оновлена з поточною ревізії %s до ревізії %s. ';
$LNG['upgrade_notavailable'] = 'Використовується сама остання ревізія %s для бази даних.';
$LNG['upgrade_required_rev'] = 'Майстер оновлення бази даних доступний з ревізії r2579 (2Moons v1.7).';

$LNG['licence_head'] = 'Ліцензійна угода';
$LNG['licence_desc'] = 'Будь ласка, прочитайте ліцензійну угоду. Використовуйте смугу прокрутки для перегляду всього документа. ';
$LNG['licence_accept'] = 'Ви згодні з усіма умовами ліцензійної угоди? Ви можете встановити програмне забезпечення, тільки якщо Ви приймаєте умови ліцензійної угоди. ';
$LNG['licence_need_accept'] = 'Для того, щоб приступити до установки, Ви повинні прийняти умови ліцензійної угоди.';

$LNG['req_head'] = 'Необхідні модулі';
$LNG['req_desc'] = 'Перед продовженням установки 2Moons виконає перевірку файлів конфігурації Вашого сервера на відповідність необхідним вимогам використання 2Moons. Будь ласка, прочитайте уважно результати і не продовжуйте установку, поки перевірка не буде пройдена по всіх пунктах. Якщо Ви хочете використовувати будь-яку з функцій перерахованих нижче модулів, Ви повинні переконатися, що перевірка пройдена. ';
$LNG['reg_yes'] = 'Так';
$LNG['reg_no'] = 'Ні';
$LNG['reg_found'] = 'Так';
$LNG['reg_not_found'] = 'Ні';
$LNG['reg_writable'] = '(CHMOD 777)';
$LNG['reg_not_writable'] = 'Не встановлені права на запис';
$LNG['reg_file'] = 'Файл &raquo; %s &laquo; доступний для запису? ';
$LNG['reg_dir'] = 'Папка &raquo; %s &laquo; доступна для запису? ';
$LNG['req_php_need'] = 'Встановлена версія &raquo; PHP &laquo;';
$LNG['req_php_need_desc'] = '<strong> Необхідно </ strong> - PHP є серверним мовою, якою написана гра. 2Moons працює без обмежень, використовуючи версію PHP 5.2.5 і вище. ';
$LNG['reg_gd_need'] = 'Встановлена версія графічної бібліотеки &raquo; gdlib&laquo;';
$LNG['reg_gd_desc'] = '<strong> Рекомендовані </ strong> - Графічна бібліотека &raquo; gdlib&laquo; відповідає за динамічну генерацію зображень. Без цієї бібліотеки не буде можливості робота деяких функціональних можливостей програмного забезпечення. ';
$LNG['reg_mysqli_active'] = 'Підтримка розширення &raquo; MySQLi &laquo;';
$LNG['reg_mysqli_desc'] = '<strong> Необхідно </ strong> - Ви повинні забезпечити підтримку MySQLi в PHP. Якщо на Вашому сервері немає підтримки бази даних, то зверніться до хостинг-провайдера і попросіть його встановити підтримку бази даних MySQLi ';
$LNG['reg_json_need'] = 'Розширення &raquo; JSON&laquo; доступно? ';
$LNG['reg_iniset_need'] = 'Функція PHP &raquo; ini_set&laquo; активна? ';
$LNG['reg_global_need'] = 'Параметр &raquo; register_globals&laquo; відключений? ';
$LNG['reg_global_desc'] = '2Moons буде коректно працювати, якщо цей параметр включений. Тим не менш, рекомендується з міркувань безпеки, відключити register_globals в налаштуваннях PHP. ';
$LNG['req_ftp_head'] = 'FTP';
$LNG['req_ftp_desc'] = 'Будь ласка, введіть Ваші дані FTP, щоб установник автоматично виправив помилки. Крім того, можна також вручну встановити дозволи на запис. ';
$LNG['req_ftp_host'] = 'FTP хост';
$LNG['req_ftp_username'] = 'FTP логін';
$LNG['req_ftp_password'] = 'FTP пароль';
$LNG['req_ftp_dir'] = 'FTP шлях до 2Moons';
$LNG['req_ftp_send'] = 'Встановити права CHMOD 777';
$LNG['req_ftp_error_data'] = 'З наданими обліковими даними не вдалося підключитися до сервера FTP.';
$LNG['req_ftp_error_dir'] = 'Папка вказана невірно.';

$LNG['step1_head'] = 'Налаштування доступу до бази даних';
$LNG['step1_desc'] = '2Moons може бути встановлена на Вашому сервері, але Ви повинні вказати настройки доступу до бази даних. Якщо Ви не знаєте налаштування доступу для підключення до бази даних, дізнайтеся їх у Вашого хостинг-провайдера або зв’язку з технічною підтримкою 2Moons для консультації. При введенні даних, будь ласка, перевірте їх уважно, перш ніж продовжити. ';
$LNG['step1_mysql_server'] = 'Ім’я сервера бази даних';
$LNG['step1_mysql_port'] = 'Порт сервера бази даних';
$LNG['step1_mysql_dbuser'] = 'Логін користувача бази даних';
$LNG['step1_mysql_dbpass'] = 'Пароль користувача бази даних';
$LNG['step1_mysql_dbname'] = 'Назва бази даних';
$LNG['step1_mysql_prefix'] = 'Префікс таблиць';

$LNG['step2_prefix_invalid'] = 'Префікс бази даних повинен містити тільки алфавітно-цифрові символи і знак підкреслення.';
$LNG['step2_db_no_dbname'] = 'Ім’я бази даних не вказано.';
$LNG['step2_db_too_long'] = 'Зазначений префікс таблиць занадто довгий. Максимальна довжина становить 36 символів. ';
$LNG['step2_db_con_fail'] = 'Немає з’єднання з базою даних. Детальна інформація вказана нижче. ';
$LNG['step2_config_exists'] = 'config.php вже існує.';
$LNG['step2_conf_op_fail'] = 'Для config.php були встановлено права на запис.';
$LNG['step2_conf_create'] = 'config.php створений.';
$LNG['step2_db_done'] = 'Підключення до бази даних встановлено.';

$LNG['step3_head'] = 'Створення таблиць бази даних';
$LNG['step3_desc'] = 'Таблиці бази даних створені і заповнені. Переходьте до наступного кроку, щоб завершити установку 2Moons. ';
$LNG['step3_db_error'] = 'Не вдалося створити такі таблиці в базі даних:';

$LNG['step4_head'] = 'Створення облікового запису адміністратора';
$LNG['step4_desc'] = 'Для створення облікового запису адміністратора введіть логін, пароль і адресу електронної пошти.';
$LNG['step4_admin_name'] = 'Логін:';
$LNG['step4_admin_name_desc'] = 'Від 3 до 20 символів.';
$LNG['step4_admin_pass'] = 'Пароль:';
$LNG['step4_admin_pass_desc'] = 'Від 6 до 30 символів.';
$LNG['step4_admin_mail'] = 'Адреса електронної пошти:';

$LNG['step6_head'] = 'Вітаємо!';
$LNG['step6_desc'] = 'Ви встановили 2Moons.';
$LNG['step6_info_head'] = 'Почніть використовувати 2Moons.';
$LNG['step6_info_additional'] = 'Якщо Ви натиснете на кнопку нижче, Ви будете перенаправлені в панель адміністратора. Витратьте деякий час на ознайомлення з доступними настройками. <br/> <br/> <Strong> Будь ласка, видаліть файл &raquo; includes / ENABLE_INSTALL_TOOL&laquo; або перейменуйте його, перш ніж використовувати гру. Поки цей файл існує, Ваша гра піддається потенційному ризику злому! </ Strong> ';

$LNG['sql_close_reason'] = 'Сервер в даний момент недоступний';
$LNG['sql_welcome'] = 'Ласкаво просимо в 2Moons v';
