<?php

// 2Moons - Copyright © 2012 Jan Kröpke <info@2moons.cc>
// Translation into Ukrainian - Copyright © 2015 Mykhailo Chika <http://mykhailochika.16mb.com>

setlocale(LC_ALL, 'ru_RU.UTF8', 'ukrainian'); // http://msdn.microsoft.com/en-us/library/39cwe7zf%28vs.71%29.aspx
setlocale(LC_NUMERIC, 'C');

// Дата і час
$LNG['dir']            = 'ltr';
$LNG['week_day']       = array('Нд', 'Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб');
$LNG['months']         = array('Січень', 'Лютий', 'Березень', 'Квітень', 'Травень', 'Червень', 'Липень', 'Серпень', 'Вересень', 'Жовтень', 'Листопад', 'Грудень');
$LNG['js_tdformat']    = '[M] [D] [d] [H]:[i]:[s]';
$LNG['php_timeformat'] = 'H:i:s';
$LNG['php_dateformat'] = 'd. M Y';
$LNG['php_tdformat']   = 'd. M Y, H:i:s';
$LNG['short_day']      = 'd';
$LNG['short_hour']     = 'h';
$LNG['short_minute']   = 'm';
$LNG['short_second']   = 's';

$LNG['timezones'] = array (
	'-12' => '[UTC - 12] Меридіан зміни дат (захід)',
	'-11' => '[UTC - 11] о. Мідуей, Самоа ',
	'-10' => '[UTC - 10] Гаваї',
	'-9.5' => '[UTC - 9:30] Маркізькі острови',
	'-9' => '[UTC - 9] Аляска',
	'-8' => '[UTC - 8] Тихоокеанський час (США і Канада) і Тіхуана',
	'-7' => '[UTC - 7] Арізона',
	'-6' => '[UTC - 6] Мехіко, Центральна Америка, Центральний час (США і Канада)',
	'-5' => '[UTC - 5] Індіана (схід), Східний час (США і Канада)',
	'-4.5' => '[UTC - 4:30] Венесуела',
	'-4' => '[UTC - 4] Сантьяго, Атлантичний час (Канада)',
	'-3.5' => '[UTC - 3:30] Ньюфаундленд',
	'-3' => '[UTC - 3] Бразилія, Гренландія',
	'-2' => '[UTC - 2] Средньоатлантичний час',
	'-1' => '[UTC - 1] Азорські острови, острови Зеленого мису',
	'0' => '[UTC] Час за Гринвічем: Дублін, Лондон, Лісабон, Единбург',
	'1' => '[UTC + 1] Берлін, Мадрид, Париж, Рим, Західна Центральна Африка',
	'2' => '[UTC + 2] Афіни, Вільнюс, Київ, Мінськ, Рига, Таллінн, Центральна Африка',
	'3' => '[UTC + 3] Волгоград, Москва, Самара, Санкт-Петербург',
	'3.5' => '[UTC + 3:30] Тегеран',
	'4' => '[UTC + 4] Баку, Єреван, Тбілісі',
	'4.5' => '[UTC + 4:30] Кабул',
	'5' => '[UTC + 5] Єкатеринбург, Ісламабад, Карачі, Оренбург, Ташкент',
	'5.5' => '[UTC + 5:30] Бомбей, Калькутта, Мадрас, Нью-Делі',
	'5.75' => '[UTC + 5:45] Катманду',
	'6' => '[UTC + 6] Алмати, Астана, Новосибірськ, Омськ',
	'6.5' => '[UTC + 6:30] Рангун',
	'7' => '[UTC + 7] Бангкок, Красноярськ',
	'8' => '[UTC + 8] Гонконг, Іркутськ, Пекін, Сінгапур',
	'8.75' => '[UTC + 8:45] Південно-східна Західна Австралія',
	'9' => '[UTC + 9] Токіо, Сеул, Чита, Якутськ',
	'9.5' => '[UTC + 9:30] Дарвін',
	'10' => '[UTC + 10] Владивосток, Канберра, Мельбурн, Сідней',
	'10 .5 '=>' [UTC + 10:30] Лорд-Хау ',
	'11' => '[UTC + 11] Камчатка, Магадан, Сахалін, Соломонові острови',
	'11 .5 '=>' [UTC + 11:30] Острів Норфолк ',
	'12' => '[UTC + 12] Нова Зеландія, Фіджі',
	'12 .75 '=>' [UTC + 12:45] Острови Чатем ',
	'13' => '[UTC + 13] Острови Фенікс, Тонга',
	'14' => '[UTC + 14] Острів Лайн',
);
